       01 RECORD-LAYOUT.
          05 FULL_NAME           PIC A(50).
          05 YEAR                PIC 9(4).
          05 AMOUNT              PIC 9(9)V99.

